## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
main.tf
```
```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                    NAME                                     |
|--------|-----------------------------------------------------------------------------|
| add    | `aws_iam_policy.s3_readonly_policy`                                         |
|        | `aws_iam_role_policy_attachment.s3_readonly_policy_attachment`              |
|        | `module.github_oidc_role.aws_iam_role.this[&quot;GHOIDCCodespacesReadOnlyRole&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.s3_readonly_policy will be created
  + resource "aws_iam_policy" "s3_readonly_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy allowing GitHub Codespaces read-only access to the specific S3 bucket"
      + id               = (known after apply)
      + name             = "github-codespaces-s3-readonly-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cra-arc-upd-tbpc-codespaces-data",
                          + "arn:aws:s3:::cra-arc-upd-tbpc-codespaces-data/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cra-arc-upd-tbpc"
          + "Purpose"     = "Codespaces Data"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Project"     = "cra-arc-upd-tbpc"
          + "Purpose"     = "Codespaces Data"
        }
    }

  # aws_iam_role_policy_attachment.s3_readonly_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "s3_readonly_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "GHOIDCCodespacesReadOnlyRole"
    }

  # module.github_oidc_role.aws_iam_role.this["GHOIDCCodespacesReadOnlyRole"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/cra-arc-upd-tbpc:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::211125499457:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GHOIDCCodespacesReadOnlyRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cra-arc-upd-tbpc"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cra-arc-upd-tbpc"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_oidc_codespaces_readonly_role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_readonly_policy"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
